Repository: petrusje/AgentSharp
Catalog: AgentSharp.console/Resources/Messages.*.resx
Languages: pt_br

# AppTitle
source: 🤖 AgentSharp - PRACTICAL EXAMPLES
pt_br: 🤖 AgentSharp - EXEMPLOS PRÁTICOS

# AppSubtitle
source: Interactive Learning System
pt_br: Sistema de Aprendizado Interativo

# SelectLanguage
source: Select your language / Selecione seu idioma:
pt_br: Selecione seu idioma / Select your language:

# LanguagePrompt
source: Choose (1-2):
pt_br: Escolha (1-2):

# TelemetryPrompt
source: Enable telemetry (detailed timing)? (y/n):
pt_br: Ativar telemetria (tempo detalhado)? (s/n):

# TelemetryEnabled
source: ✅ Telemetry enabled - detailed timing will be shown
pt_br: ✅ Telemetria ativada - tempo detalhado será exibido

# TelemetryDisabled
source: 📊 Telemetry disabled - only basic timing shown
pt_br: 📊 Telemetria desativada - apenas tempo básico será exibido

# ApiKeyFound
source: ✅ API Key found! Endpoint: {0}
pt_br: ✅ API Key encontrada! Endpoint: {0}

# ApiKeyError
source: ❌ Error: OPENAI_API_KEY environment variable not configured!
pt_br: ❌ Erro: Variável de ambiente OPENAI_API_KEY não configurada!

# ApiKeyInstructions1
source: 1. Copy env.example file to .env
pt_br: 1. Copie o arquivo env.example para .env

# ApiKeyInstructions2
source: 2. Edit .env file with your OpenAI key
pt_br: 2. Edite o arquivo .env com sua chave da OpenAI

# ApiKeyInstructions3
source: 3. Run the program again
pt_br: 3. Execute novamente o programa

# EnvFileLocation
source: .env file should be at: {0}
pt_br: Arquivo .env deve estar em: {0}

# ModelInitialized
source: ✅ OpenAI model initialized successfully!
pt_br: ✅ Modelo OpenAI inicializado com sucesso!

# ModelDetails
source: Model: {0} | Temp: {1} | Max Tokens: {2}
pt_br: Modelo: {0} | Temp: {1} | Max Tokens: {2}

# MenuTitle
source: 📋 MAIN MENU - Learn AgentSharp from Basic to Advanced:
pt_br: 📋 MENU PRINCIPAL - Aprenda AgentSharp do Básico ao Avançado:

# MenuFoundations
source: 🌱 LEVEL 1: FOUNDATIONS - Basic Concepts
pt_br: 🌱 NÍVEL 1: FUNDAMENTOS - Conceitos Básicos

# MenuIntermediate
source: 🚀 LEVEL 2: INTERMEDIATE - Advanced Features
pt_br: 🚀 NÍVEL 2: INTERMEDIÁRIO - Recursos Avançados

# MenuAdvanced
source: ⚡ LEVEL 3: ADVANCED - Complex Cases
pt_br: ⚡ NÍVEL 3: AVANÇADO - Casos Complexos

# MenuOption1
source: 1. 🎯 Simple Agent - First Interaction
pt_br: 1. 🎯 Agente Simples - Primeira Interação

# MenuOption2
source: 2. 🎭 Agent with Personality - Basic Customization
pt_br: 2. 🎭 Agente com Personalidade - Customização Básica

# MenuOption3
source: 3. 🔧 Agent with Tools - Integrated Features
pt_br: 3. 🔧 Agente com Tools - Ferramentas Integradas

# MenuOption4
source: 4. 🧠 Agent with Reasoning - Reasoning Chains
pt_br: 4. 🧠 Agente com Raciocínio - Cadeias de Reasoning

# MenuOption5
source: 5. 📊 Structured Outputs - Typed Data
pt_br: 5. 📊 Outputs Estruturados - Dados Tipados

# MenuOption6
source: 6. 💾 Agent with Memory - State Persistence
pt_br: 6. 💾 Agente com Memória - Persistência de Estado

# MenuOption7
source: 7. 🔄 Multi-agent Workflows - Orchestration
pt_br: 7. 🔄 Workflows Multi-agente - Orquestração

# MenuOption8
source: 8. 🔍 Semantic Search - Embeddings and Vectors
pt_br: 8. 🔍 Busca Semântica - Embeddings e Vetores

# MenuOptionExit
source: 0. ❌ Exit
pt_br: 0. ❌ Sair

# MenuPrompt
source: Enter your choice (0-8):
pt_br: Digite sua escolha (0-8):

# InvalidOption
source: ❌ Invalid option. Try again (0-8).
pt_br: ❌ Opção inválida. Tente novamente (0-8).

# ContinuePrompt
source: Press any key to continue...
pt_br: Pressione qualquer tecla para continuar...

# Goodbye
source: 👋 Thank you for using AgentSharp!
pt_br: 👋 Obrigado por usar AgentSharp!

# Executing
source: 🚀 Executing: {0}
pt_br: 🚀 Executando: {0}

# ExecutionTime
source: ⏱️ Execution time: {0:F2}s
pt_br: ⏱️ Tempo de execução: {0:F2}s

# ExecutionError
source: ❌ Error executing example: {0}
pt_br: ❌ Erro ao executar exemplo: {0}

# ErrorDetails
source: 🔍 Details: {0}
pt_br: 🔍 Detalhes: {0}

# FatalError
source: ❌ Fatal error: {0}
pt_br: ❌ Erro fatal: {0}

# TelemetryLLMStart
source: ⏳ LLM Request starting...
pt_br: ⏳ Solicitação LLM iniciando...

# TelemetryLLMComplete
source: ✅ LLM Response: {0:F2}s | Tokens: {1} | Cost: ~${2:F4}
pt_br: ✅ Resposta LLM: {0:F2}s | Tokens: {1} | Custo: ~${2:F4}

# TelemetryMemoryOperation
source: 💾 Memory operation: {0} ({1:F2}s)
pt_br: 💾 Operação memória: {0} ({1:F2}s)

# TelemetryToolExecution
source: 🔧 Tool '{0}' executed: {1:F2}s
pt_br: 🔧 Tool '{0}' executada: {1:F2}s

# ExampleSimpleAgent
source: 🎯 FOUNDATIONS: Simple Agent
pt_br: 🎯 FUNDAMENTOS: Agente Simples

# ExamplePersonalityAgent
source: 🎭 FOUNDATIONS: Agent with Personality
pt_br: 🎭 FUNDAMENTOS: Agente com Personalidade

# ExampleToolsAgent
source: 🔧 FOUNDATIONS: Agent with Tools
pt_br: 🔧 FUNDAMENTOS: Agente com Tools

# ExampleReasoningAgent
source: 🧠 INTERMEDIATE: Agent with Reasoning
pt_br: 🧠 INTERMEDIÁRIO: Agente com Raciocínio

# ExampleStructuredOutput
source: 📊 INTERMEDIATE: Structured Outputs
pt_br: 📊 INTERMEDIÁRIO: Outputs Estruturados

# ExampleMemoryAgent
source: 💾 INTERMEDIATE: Agent with Memory
pt_br: 💾 INTERMEDIÁRIO: Agente com Memória

# ExampleWorkflows
source: 🔄 ADVANCED: Multi-agent Workflows
pt_br: 🔄 AVANÇADO: Workflows Multi-agente

# ExampleSemanticSearch
source: 🔍 ADVANCED: Semantic Search
pt_br: 🔍 AVANÇADO: Busca Semântica
